[
  {
    "event": "Stamp Gallery: Lights Off at 8 pm",
    "date": "Tue Sep 02 - Sun Oct 12",
    "time": "10:00am - 5:00pm",
    "url": "https://calendar.umd.edu/stamp-gallery-lights-off-at-8-pm",
    "location": "N/A",
    "description": "The Stamp Gallery is pleased to present Lights Off at 8 pm , a group exhibition featuring artists that approach memory as inherently fluid and ever-shifting, capable of evoking different emotions—love, grief, joy, anxiety, fear—at once and across time. Rather than seeking to preserve the past, these artists embrace the distortion, abstraction, and reinvention of memories, inviting the audience to consider alternative ways of remembering."
  },
  {
    "event": "Fall 2025 Exhibition: Solace and Sisterhood",
    "date": "Thu Sep 11 - Wed Dec 10",
    "time": "N/A",
    "url": "https://calendar.umd.edu/fall-2025-exhibition-solace-and-sisterhood",
    "location": "N/A",
    "description": "Solace and Sisterhood is supported in part by the Harriet Tubman Department of Women, Gender, and Sexuality Studies (WGSS) at the University of Maryland.\n\nVisit The Driskell Center from September 11 to December 10 for the Fall 2025 exhibition, Solace and Sisterhood . The Center is open to the public Monday through Friday, from 11 AM to 4 PM."
  },
  {
    "event": "Sister to Sister Program Accepting Applications",
    "date": "Mon Sep 15 - Wed Oct 01",
    "time": "4:26pm - 11:59pm",
    "url": "https://calendar.umd.edu/sister-to-sister-program-accepting-applications",
    "location": "Location Online Registration Link: Register Now Google Form",
    "description": "JOIN SISTER TO SISTER\n\nThe Office of Multi-ethnic Student Education Sister to Sister program fosters first-year students’ personal, academic, and professional success through workshops, tutoring, and community.\n\nWhy Join?\n\nJoin a sisterhood that values and uplifts your authentic self!\n\nApply to be a part of Sister to Sister by October 1, 2025.\n\nFor more information or questions, contact: sistertosister@umd.edu"
  },
  {
    "event": "Mental Health Awareness Week 2025",
    "date": "Mon Sep 29 - Fri Oct 03",
    "time": "12:00pm - 6:00pm",
    "url": "https://calendar.umd.edu/mental-health-awareness-week-2025",
    "location": "Location University of Maryland Campus Check out the calendar of events for location details!",
    "description": "The Mental Health Coalition invites you to Mental Health Awareness Week Sept. 29 – Oct. 3. We have a full week of FUN and FREE programming to explore and improve mental health. Join us as we celebrate self-care and STAMP out stigma. Now, more than ever, is the right time to improve your mental health.\n\nWith a variety of events involving plant-decorating, mental health screenings, celebrity Q&A, crafts, and more--there is something for everyone! And don’t forget to check out the Self-Care Fair with therapy dogs, inflatables, massages, giveaways, free food, and self-care activities!"
  },
  {
    "event": "LGBTQ+ History Month",
    "date": "Wed Oct 01 - Sat Nov 01",
    "time": "N/A",
    "url": "https://calendar.umd.edu/lgbtq-history-month-2",
    "location": "Location Adele H. Stamp Student Union 3972 Campus Drive College Park, MD 20742 Get Directions with Google Maps Events that are part of the LGBTQ+ History Month schedule will take place at various locations, both on- and off-campus.",
    "description": "For queer people and allies, dreaming has always been more than rest—it has been survival, imagination, and resistance. Queer dreaming exists across generations: in whispered hopes, in coded language passed in bars and ballrooms, in the brave declarations of those who demanded to be seen. We dream not only of safety, but of possibility. In dreaming together, we create a lineage of vision that connects our past, sustains our present, and propels us toward the futures we deserve.\n\nThis October, we celebrate the dreams that brought us here and commit to the ones that will carry us forward. Explore the LGBTQ+ History Month 2025 calendar of events to learn more about this year's incredible programs. All are welcome to come and dream with us."
  },
  {
    "event": "SPAP Open House",
    "date": "2025-10-01",
    "time": "9:00am - 3:00pm",
    "url": "https://calendar.umd.edu/spap-open-house",
    "location": "Location Jimenez Hall 2215",
    "description": "Discover all the opportunities the Department of Spanish and Portuguese has for you! Jiménez Hall (JMZ 2215)."
  },
  {
    "event": "SPAP Open House",
    "date": "2025-10-01",
    "time": "9:00am - 3:00pm",
    "url": "https://calendar.umd.edu/spap-open-house-2",
    "location": "Location Jimenez Hall Jimenez Hall, 2215",
    "description": "Discover all the opportunities the Department of Spanish and Portuguese has for you! Jiménez Hall (JMZ 2215)."
  },
  {
    "event": "Faculty & Staff Flu Vaccine Clinics",
    "date": "2025-09-24",
    "time": "9:00am - 3:00pm",
    "url": "https://calendar.umd.edu/faculty-staff-flu-vaccine-clinics",
    "location": "N/A",
    "description": "The University Health Center is providing faculty and staff flu clinics weekly on Wednesdays, September 24 - October 29. Schedule your appointment today! Flu vaccine clinics are located on the ground floor of the UHC in the Occupational Health Suite # 0106. For more information and to schedule your appointment, visit health.umd.edu/umd-employees."
  },
  {
    "event": "UMD Farmer's Market",
    "date": "2025-09-03",
    "time": "11:00am - 3:00pm",
    "url": "https://calendar.umd.edu/umd-farmers-market-2",
    "location": "Location Tawes Plaza The market takes place at Tawes Plaza, rain or shine. Parking is very limited in this area, so consider walking or biking!",
    "description": "The UMD Farmers Market features local vendors from within 250 miles of College Park. Every farmer and producer selling at our market grows or makes what they sell themselves. Come enjoy snacks, goodies, treats, live music, and fun! Stop by on your way to class or come and stay for a while.\n\nThe full list of vendors is our website, but may vary depending on the week. Sign up for our weekly newsletter to learn about new vendors and who will be at the market each week."
  },
  {
    "event": "N/A",
    "date": "N/A",
    "time": "N/A",
    "url": "https://calendar.umd.edu/leap-preschool-program-touring-dates?start=25-10-01",
    "location": "N/A",
    "description": "N/A"
  },
  {
    "event": "Wellness Course: Executive Functioning Session I",
    "date": "2025-10-01",
    "time": "12:00pm - 1:30pm",
    "url": "https://calendar.umd.edu/wellness-course-executive-functioning-session-i",
    "location": "Location Lee Building Lee Building (Room 2124) 7809 Regents Drive Lee Building (2nd floor room 2124), COLLEGE PARK, MD",
    "description": "The first session will be an overview of executive functioning as well as factors that can impact executive functioning such as task management, productivity, procrastination and prioritization. The session will be helpful with students who want to learn more about executive functioning and determine potential treatment approaches. The session will be in-person in Lee 2124 and food will be provided. If you need any accommodations and/or have any questions or concerns, please email gs-counselor@umd.edu."
  },
  {
    "event": "Self-Care Fair (Mental Health Awareness Week)",
    "date": "2025-10-01",
    "time": "12:00pm - 3:00pm",
    "url": "https://calendar.umd.edu/self-care-fair-mental-health-awareness-week-3",
    "location": "Location McKeldin Mall 7649 Library Lane College Park, MD 20742-7011 Get Directions with Google Maps",
    "description": "Join us at the Self-Care Fair to celebrate good mental health! We’ll have carnival games, therapy dogs, free food, self-care activities, prizes, mental health resources, and more! This event is part of Mental Health Awareness Week 2025."
  },
  {
    "event": "Wind Down Wednesday",
    "date": "2025-09-10",
    "time": "12:00pm - 1:00pm",
    "url": "https://calendar.umd.edu/wind-down-wednesday-12",
    "location": "Location Memorial Chapel 7744 Regents Drive College Park, MD 20742 Get Directions with Google Maps",
    "description": "Enjoy a calming lunchtime in the peaceful Garden Chapel against a backdrop of live music. Follow up with a walk outside in the meditative labyrinth in the Garden of Reflection and Remembrance. A simple lunch is provided."
  },
  {
    "event": "UMD's Sesame Street Archival Showcase",
    "date": "2025-10-01",
    "time": "12:30pm - 4:00pm",
    "url": "https://calendar.umd.edu/umds-sesame-street-archival-showcase",
    "location": "Location Hornbake Library 4130 Campus Drive College Park, MD 20740 Get Directions with Google Maps Library Lobby",
    "description": "Please join the Jim Henson Working Group, the Children's Media Working Group,\n\nthe Hornbake Library, The Center for Archival Futures, and the Clarice Smith Library for a celebration of UMD's long standing archival relationship to Sesame Street and Jim Henson: \"The UMD Sesame Street Archival Showcase.\" The exhibit opening ceremony will take place on October 1st, from12:30PM-4:00PM in the Hornbake Library lobby . At 2PM, Jim Henson Corporation Archivist Susie Toft will speak.\n\nOpen until December 20th, The Sesame Street Archival Showcase , under the broader exhibit Unboxing Innovation at UMD , will focus on the archival material that demonstrates the “hidden curriculum” of Sesame Street to educate underrepresented communities across urban and rural areas in the United States. This exhibit involves highlighting the importance of African American culture, celebrity and context to the creation and success of Sesame Street. The exhibit will host the be-bopping, jive talking puppet Roosevelt Franklin, created by Jim Henson, discuss his success as a character, the political outcry in response, and his eventual discontinuation. The showcase aims to demonstrate the strength of the UMD archives in Radio, Television, and Public Media. These growing archives provide an untapped resource for creative teaching practices here at UMD in the humanities, the social sciences, and education."
  },
  {
    "event": "ChilLACS",
    "date": "2025-10-01",
    "time": "2:00pm - 4:00pm",
    "url": "https://calendar.umd.edu/chillacs?start=25-10-01",
    "location": "Location H.J. Patterson Hall Atrium (first floor public space)",
    "description": "We invite you to tap into your creativity and relax while you learn about art and music styles from across Latin America and the Caribbean. Tea and treats provided! All are welcome to attend!\n\nHJ Patterson Atrium (First Floor)"
  },
  {
    "event": "The Wellness Series: Pay Attention! Tips to Improve Focus",
    "date": "2025-10-01",
    "time": "4:00pm - 5:00pm",
    "url": "https://calendar.umd.edu/the-wellness-series-pay-attention-tips-to-improve-focus-5?start=25-10-01",
    "location": "Location Online Registration Link: Registration Link to The Wellness Series: __________ The link will take you to the Zoom registration page for this series",
    "description": "In a world full of distractions, it’s easy to lose focus. This session will provide helpful strategies to improve concentration and let go of distractions.\n\nAdvanced registration is not required. Please know that this is a skill-building session and is not a confidential therapy space. The session will close to new participants 15 minutes after the start time. More information about all Wellness Session topics can be found at counseling.umd.edu/wellness"
  },
  {
    "event": "Grad Student Game Night with the LGBTQ+ Equity Center",
    "date": "2025-10-01",
    "time": "6:00pm - 8:00pm",
    "url": "https://calendar.umd.edu/grad-student-game-night-with-the-lgbtq-equity-center",
    "location": "Location Adele H. Stamp Student Union 3972 Campus Drive College Park, MD 20742 Get Directions with Google Maps Stamp Grand Ballroom Lounge",
    "description": "Join the LGBTQ+ Equity Center for a Grad Student Game Night on Wednesday, October 1st, from 6:00-8:00pm in the Stramp Grand Ballroom Lounge! Grad Student Game Night will be an opportunity for graduate students from across the university to relax, share space, play games, and socialize! The room will be set up with 8-9 round tables, each with a different game or set of games for people to engage with.\n\nRSVP at https://go.umd.edu/GradGame25\n\nFor questions or accommodations, email lgbtq@umd.edu ."
  },
  {
    "event": "UPP & University Career Center Series Workshop Series 1: Get Career Ready with Key Employer Competencies and UMD Basics for Professional Success",
    "date": "2025-10-01",
    "time": "6:00pm - 7:00pm",
    "url": "https://calendar.umd.edu/upp-university-career-center-series-workshop-series-1-get-career-ready-with-key-employer-competencies-and-umd-basics-for-professional-success",
    "location": "Location Online Registration Link: Register Now Zoom",
    "description": "Career Readiness competencies are key to selecting internships and acquiring jobs. These competencies are essential for success in the workplace, as employers, organizations, and institutions seek them in interns and new hires.\n\nIn this workshop, learn about the competencies, what they are, and why they are desired. Also, learn how to assess your own and develop them in the classroom and other experiences. Plus, you will be informed about the University Career Center’s resources, tools, programs, and events designed to help you launch or enhance your career journey."
  },
  {
    "event": "Guest Artist Series: Velvet Brown, tuba",
    "date": "2025-10-01",
    "time": "8:00pm - 10:00pm",
    "url": "https://calendar.umd.edu/guest-artist-series-velvet-brown-tuba",
    "location": "Location The Clarice Smith Performing Arts Center 8270 Alumni Drive College Park, MD 20742-1625 Get Directions with Google Maps",
    "description": "Velvet Brown is an internationally acclaimed professor, soloist, chamber musician, conductor and recording artist. Having collaborated with jazz and commercial legends like Howard Johnson, Bob Stewart, and Doc Severinsen, she draws inspiration from life experiences to explore how personal events shape creativity, inspiring a veritable musical renaissance. Her performances are hallmarked by soul-searching musical patterns that help her develop a more profound relationship with the audience. Join us as Brown performer a special recital as a part of our Guest Artist Series!"
  },
  {
    "event": "Info Session: Master of Science in GIS & Graduate Certificate in GIS or Remote Sensing",
    "date": "2025-10-02",
    "time": "12:00pm - 1:00pm",
    "url": "https://calendar.umd.edu/info-session-master-of-science-in-gis-graduate-certificate-in-gis-or-remote-sensing-2",
    "location": "Location Online Registration Link: Event registration link Event registration link",
    "description": "The Master of Science in Geospatial Information Sciences (MS GIS) program is dedicated to providing the most up-to-date education on geospatial technology, theory and applications. The courses cover spatial analysis, statistics, programming, databases, modeling, remote sensing, Web GIS, Mobile GIS, big data analytics, drones for data collection, and Open Source GIS."
  },
  {
    "event": "Extending Time in ELMS-Canvas Quizzes",
    "date": "2025-10-02",
    "time": "12:00pm - 1:00pm",
    "url": "https://calendar.umd.edu/extending-time-in-elms-canvas-quizzes",
    "location": "Location Online Registration Link: Register via Workday Register via Workday",
    "description": "Please join us as we review the steps required for extending time in ELMS-Canvas quizzes. It's important to make sure you know how to implement extended time in exams given through the ELMS-Canvas quiz tool for any of your students who have this accommodation. We will cover extending time in both classic quizzes and new quizzes, as the steps are slightly different.\n\nThis webinar will take place in Zoom. Live automatic captions will be provided for this event"
  },
  {
    "event": "N/A",
    "date": "N/A",
    "time": "N/A",
    "url": "https://calendar.umd.edu/disabled-worker-affinity-lunch?start=25-10-02",
    "location": "N/A",
    "description": "N/A"
  },
  {
    "event": "GIS & Data Science Help Desk",
    "date": "2025-10-02",
    "time": "1:00pm - 3:00pm",
    "url": "https://calendar.umd.edu/gis-data-science-help-desk?start=25-10-02",
    "location": "Location Online Registration Link: Learn more and register here Link to LibCal Library event",
    "description": "UMD Libraries GIS and Data Service Center is here to assist you with a wide range of services, ranging from data analysis and visualization to data cleaning and transformation. We specialize in transforming raw data into actionable insights to help you make informed decisions. Whether you're looking to harness the power of big data, optimize your data infrastructure/workflow, or simply need assistance with a data-related challenge, our friendly and knowledgeable team is ready to assist you in any way possible. We offer support for ArcGIS, StoryMapping, Open Source GIS, Python, R, NVivo, Tableau, and Power BI. No prior experience needed, just show up. See experts showing tools and techniques that will inspire you. Bring you own dataset to ask questions."
  },
  {
    "event": "Touch of Slavery (Deaf Blind Production)",
    "date": "2025-10-02",
    "time": "4:00pm - 4:30pm",
    "url": "https://calendar.umd.edu/touch-of-slavery-deaf-blind-production",
    "location": "Location The Clarice Smith Performing Arts Center 8270 Alumni Drive College Park, MD 20742-1625 Get Directions with Google Maps",
    "description": "Five Black DeafBlind actors bring to life the untold stories of DeafBlind enslaved people in a groundbreaking play.\n\nA Touch of Slavery is a radically new kind of theater, performed by DeafBlind actors in Protactile, the language of the DeafBlind community. As a tactile form of communication, Protactile requires a different model of performance. Actors and audience members interact directly. In this production, a collaboration between PT411, Richmond Area Black Deaf Advocates, and TDPS, audiences will experience a moving journey through the lives of nineteenth-century DeafBlind slaves. Knowledge of Protactile or American Sign Language is NOT required for this production. Actors will adapt their performance to fit each person’s needs.\n\nProtactile is a physical language and involves direct contact with actors. Safe touch zones are part of Protactile. These include arms, front parts of legs, collarbone area, and head. Audience members will be blindfolded during the show.\n\nDue to the topic, this show is recommended for mature teenagers and adults only. Run time is approximately 15 minutes, with reflection time afterwards. Please arrive 15 minutes before your ticked time. If you arrive late, you may not be able to attend the show."
  },
  {
    "event": "Xperience Competition MiXer",
    "date": "2025-10-02",
    "time": "5:30pm - 6:30pm",
    "url": "https://calendar.umd.edu/xperience-competition-mixer-2",
    "location": "Location E.A. Fernandez IDEA Factory 4462 Stadium Dr College Park, MD 20740 Get Directions with Google Maps",
    "description": "Ready to turn big ideas into real-world impact? Join fellow students and members of the xFoundry team to participate in interactive activities and potentially meet teammates, fellow competitors, and receive additional Xperience Competition details.\n\nP.S. pizza will be served at the end!"
  },
  {
    "event": "UPP & Career Center Series Workshop Series 2: Be Career Ready! Assess Your Search Strategies for Internships and Jobs",
    "date": "2025-10-02",
    "time": "6:00pm - 7:00pm",
    "url": "https://calendar.umd.edu/upp-career-center-series-workshop-series-2-be-career-ready-assess-your-search-strategies-for-internships-and-jobs",
    "location": "Location Online Registration Link: Register Now Zoom Link",
    "description": "Gaining experience while still in college is essential for career success. It helps acquire job opportunities.\n\nIn this workshop, you will assess your Career Readiness competencies, learning what is needed to develop for your desired career. Also, learn how to use your Career Readiness competencies to craft an effective search strategy."
  },
  {
    "event": "Christian McBride & Brad Mehldau",
    "date": "2025-10-02",
    "time": "8:00pm - 10:00pm",
    "url": "https://calendar.umd.edu/christian-mcbride-brad-mehldau",
    "location": "N/A",
    "description": "Kick off The Clarice’s silver anniversary with two of the most respected artists in contemporary jazz. Hailed “one of modern jazz’s most innovative musicians” by Glide Magazine, Christian McBride says, “Brad is justifiably revered as one of the greatest pianists of all time. I’m very proud to have been friends and cohorts with him for almost 35 years. He was one of the first people I met when I moved to New York City in 1989, and it continues to be an uplifting experience every time we play together.” Named “one of our greatest living pianists” by NPR, Brad Mehldau says, “It is a dream come true to play with Christian in this duo setting. Playing with Christian, especially in this configuration, is both joyful and daunting all at once. His level of sophistication and swing, of emotional power and grace, is unsurpassed–not in the least on what he has achieved on his instrument, but also as one of our strongest voices in the music more generally, at the top of his game. I’m so honored to be on stage with him.” This longtime friendship and musical camaraderie has led to various collaborations through the years including the albums MoodSwing (1994), RoundAgain (2020) and LongGone (2023) with Joshua Redman and Brian Blade; trio tour dates with drummer Marcus Gilmore; and a recent duo performance at the Big Ears Festival that had the crowd utterly captivated."
  },
  {
    "event": "Back to School Lecture: An Evening With Giancarlo Esposito",
    "date": "2025-10-02",
    "time": "8:00pm - 10:00pm",
    "url": "https://calendar.umd.edu/back-to-school-lecture-an-evening-with-giancarlo-esposito",
    "location": "Location Adele H. Stamp Student Union 3972 Campus Drive College Park, MD 20742 Get Directions with Google Maps STAMP Grand Ballroom",
    "description": "Join SEE for our annual Back to School Lecture featuring Giancarlo Esposito! With a career spanning from Broadway, to TV, to video games, to the silver screen, you’ll get to hear the details from the actor and director himself during both the moderated Q&A and audience Q&A (time permitting)!\n\nThe event will take place on Thursday, October 2nd at STAMP Grand Ballroom, at 8PM. Doors open at 7PM and close at 8:15PM. Tickets are free and REQUIRED for this event and will be available through the link in our bio (or umdtickets.com) starting on Thursday, September 11th at 12:00PM."
  }
]